cf/InformationRegisters/нсиПраваДоступаНаВидыСправочников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>нсиПраваДоступаНаВидыСправочников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Просмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Добавление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Редактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПометкаНаУдаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СнятиеПометкиНаУдаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалениеПомеченных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСправочника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиВидыСправочников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/нсиПраваДоступаНаВидыСправочников/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПросмотрПриИзменении(Элемент)
	Если не Запись.Просмотр Тогда
		Запись.Добавление = Ложь;
		Запись.Редактирование = Ложь;
		Запись.ПометкаНаУдаление = Ложь;
		Запись.СнятиеПометкиНаУдаление = Ложь;
		Запись.Удаление = Ложь;
		Запись.УдалениеПомеченных = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ТекущаяСтрока", Запись.Пользователь);
	ПараметрыФормы.Вставить("ВыборГруппПользователей", Истина);
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеПриИзменении(Элемент)
	Если Запись.Добавление Тогда
		Запись.Просмотр = Истина;
		Запись.Редактирование = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеПриИзменении(Элемент)
	Если Запись.Редактирование Тогда
		Запись.Просмотр = Истина;
	Иначе
		Запись.Добавление = Ложь;
		Запись.ПометкаНаУдаление = Ложь;
		Запись.СнятиеПометкиНаУдаление = Ложь;
		Запись.Удаление = Ложь;
		Запись.УдалениеПомеченных = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПометкаНаУдалениеПриИзменении(Элемент)
	Если Запись.ПометкаНаУдаление Тогда
		Запись.Просмотр = Истина;
		Запись.Редактирование = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СнятиеПометкиНаУдалениеПриИзменении(Элемент)
	Если Запись.СнятиеПометкиНаУдаление Тогда
		Запись.Просмотр = Истина;
		Запись.Редактирование = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалениеПриИзменении(Элемент)
	Если Запись.Удаление Тогда
		Запись.Просмотр = Истина;
		Запись.Редактирование = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалениеПомеченныхПриИзменении(Элемент)
	Если Запись.УдалениеПомеченных Тогда
		Запись.Просмотр = Истина;
		Запись.Редактирование = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
